This also happens when chosing a built-in role definition from Azure. Once assigned, this gets localized to the subscription, which then causes a replacement every terraform run. So assigning it, changes the role_definition_id to include the subscription.

Initial run:
```
resource "azuread_application" "terraform-dns" {
  name                       = "terraform-dns"
  homepage                   = "http://localhost"
  identifier_uris            = ["http://localhost"]
  reply_urls                 = ["http://localhost"]
  available_to_other_tenants = false
  oauth2_allow_implicit_flow = true
}

resource "azuread_service_principal" "terraform-dns" {
  application_id = azuread_application.terraform-dns.application_id
  app_role_assignment_required = false
}

resource "azuread_service_principal_password" "terraform-dns" {
  service_principal_id = azuread_service_principal.terraform-dns.id
  value                = (sensitive data)
  end_date             = "2099-01-01T01:02:03Z"
}

data "azurerm_dns_zone" "my-zone" {
  name                = "my-zone"
  resource_group_name = "my-rg"
}

data "azurerm_role_definition" "dns" {
  name = "DNS Zone Contributor"
}

resource "azurerm_role_assignment" "terraform-dns" {
  role_definition_id   = data.azurerm_role_definition.dns.role_definition_id
  scope                = data.azurerm_dns_zone.my-zone.id
  principal_id         = azuread_service_principal.terraform-dns.id
}
```

Second run of the same plan gives:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.terraform-dns must be replaced
-/+ resource "azurerm_role_assignment" "terraform-dns" {
      ~ id                               = "/subscriptions/(sub)/resourceGroups/(my-rg)/providers/Microsoft.Network/dnszones/(my-zone)/providers/Microsoft.Authorization/roleAssignments/f7e94906-a4a6-1195-84bc-0f69a8430600" -> (known after apply)
      ~ name                             = "f7e94906-a4a6-1195-84bc-0f69a8430600" -> (known after apply)
        principal_id                     = "a7a05511-290d-42c9-8199-8c78370d6ada"
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/(sub)/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> "/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" # forces replacement
      ~ role_definition_name             = "DNS Zone Contributor" -> (known after apply)
        scope                            = "/subscriptions/(sub)/resourceGroups/(my-rg)/providers/Microsoft.Network/dnszones/(my-zone)"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```